//************************************************************************************/
//Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает 

// Random random = new Random(); //1.1 получить случайное число
// int min = 10; //1.2  Задать промежуток в котором мы хотим получить случайное число
// int max = 99; // 1.2
// int number = random.Next(min, max + 1); //1.3 Получение случайного числа

// int a = number % 10;// 2.1.1. Получить все цифры числа
// int b = number / 10;// 2.1.2.

// if (a > b)
// {
//  Console.WriteLine($"в числе {number} самая большая цифра {a}");
// }
// else
// {
//     Console.WriteLine($"в числе {number} самая большая цифра {b}");
// }

//************************************************************************************/
// Задача. Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа 
// например 456 -> 46  или  782 -> 72
//1.1 получить случайное число
//1.2  Задать промежуток в котором мы хотим получить случайное число
//1.3 Получение случайного числа
// 2.1.1. Получаем 3 цифру
// 2.1.2. Получаем 2 цифру

// Вариант1___________________________________________________________________________
// Random random = new Random(); //1.1 получить случайное число
// int min = 100;                //1.2  Задать промежуток в котором мы хотим получить случайное число
// int max = 999;                // 1.2
// int number = random.Next(min, max + 1); //1.3 Получение случайного числа
// Console.WriteLine (number);
// int a = number % 10;                    // 2.1.1. Получаем 3 цифру
// //int b = number / 10 % 10;               // 2.1.2. Получаем 2 цифру
// int c = number / 100;                   // 2.1.2. Получаем 1 цифру
// Console.WriteLine($"из числа {number} цифра {c}{a}");
 
//Вариант2___________________________________________________________________________
// int i = 359;
// string s = i.ToString();
// string result = s[0].ToString() + s(2).ToString();
// Console.WriteLine(result);


//___________________________________________________________________________________
// Генератор случайных чисел
// Random rnd = new.Random();
// for (int i = 0; i < 1000000; i++)
// {
// Console.WriteLine(rnd.Next());
//}

//**********************************************************************************/
//Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. Если число 2 не кратно числу 1, то программа выводит остаток от деления.
//34, 5 -> не кратно, остаток 4 
//16, 4 -> кратно

//Вариант1____________________________________________________________________________
// int a = int.Parse(Console.ReadLine());
// int b = int.Parse(Console.ReadLine());
// if (a > b)
// {
//     if (a % b == 0)
//     {
//         Console.WriteLine("Всё круто делится!!!");
//     }
// }
// else
// {
//     Console.WriteLine("Всё делится не круто!!!");
//     Console.WriteLine(a % b);
// }

 //Вариант2________________________________________________________________________
// Console.Write("Введите первое число: ");
// int.TryParse(Console.ReadLine(), out int first);
// Console.Write("Введите второе число: ");
// int.TryParse(Console.ReadLine(), out int second);

// if (first > second)
// {
//   int compare = first % second;
//   if (compare == 0) Console.WriteLine($"{first} кратно {second}");
//   else Console.WriteLine($"Остаток от деления {compare}");
// }
// else
// {
//   int compare = second % first;
//   if (compare == 0) Console.WriteLine($"{second} кратно {first}");
//   else Console.WriteLine($"Остаток от деления {compare}");
// }


//_______________________________________________________________________
// string cat = "Big Cat";
// if (cat.Contains("Big") && cat.Contains("Cat"))// && - и
// {
//     Console.WriteLine("Yes")
// }
//_______________________________________________________________________
// string cat = "Big Cat";
// if (cat.Contains("Big") || cat.Contains("Cat"))// ||- или
// {
//     Console.WriteLine("Yes")
// }
//_______________________________________________________________________

//*****************************************************************************
//Напишите программу, которая принимает на вход число и проверяет, кратно ли 
//оно одновременно 7 и 23.
//14 -> нет 
//46 -> нет 
//161 -> да

// Console.WriteLine("Введите число: ");
// int a = int.Parse(Console.ReadLine());
// int b = 7;
// int c = 23;
                
// if (a % b == 0 && a % c == 0)
// {
//     Console.WriteLine($"Число {a} кратно {b} и {c}");
// }

//Задача************************************************************************
// ______________________________________________________________________________
// int a = 1;
// int count = 0;
// int sum = 0;
// while (count < 5)
// {
// 		if ((a % 2 == 0) && (a % 3 ==0))
// 		{
// 			sum = sum + a;
// 			count++;
// 		}
// 			a++;
// }
// Console.WriteLine(sum);


// Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
// 5, 25  ->  да
// -4, 16  ->  да
// 25, 5  ->  да
// 8,9  ->  нет
//______________________________________________________________________
// Решение:

Console.Write("Введите первое число: ");
int a, b;
a = Convert.ToInt32(Console.ReadLine());
b = Convert.ToInt32(Console.ReadLine());

if (a == Math.Pow (b, 2) || b == Math.Pow (a, 2))
{
Console.WriteLine("Да");
}
else
{
Console.WriteLine("Нет");
}
// ________________________________________________________
// Вариант 2
// Console.Write("Введите первое число: ");
// int a = int.Parse(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int b = int.Parse(Console.ReadLine());

// if (Math.Abs(a) == Math.Sqrt(b) || Math.Abs(b) == Math.Sqrt(a))
// {
//   Console.WriteLine("Да");
// }
// else Console.WriteLine("Нет");



//_______________________________________________________________________
// {
//   int compare = first % second;
//   if (compare == 0) Console.WriteLine($"{first} кратно {second}");
//   else Console.WriteLine($"Остаток от деления {compare}");
// }
// else
// {
//   int compare = second % first;
//   if (compare == 0) Console.WriteLine($"{second} кратно {first}");
//   else Console.WriteLine($"Остаток от деления {compare}");
// }
//_______________________________________________________________________


