/*________________________________________________________________________________________________
// ++++++++++++++++++++++++++++++++++++++++++++++Задача №5++++++++++++++++++++++++++++++++++++++++ 
//______________________________________________________________________________________________*/

/* 
Напиши программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке  от  -N до N
Пример:
 4 -> -4, -3, -2, -1, 0, 1, 2, 3, 4
 2 -> -2, -1, 0, 1, 2

*/
/*************************************Решение: Вариант 1. (с циклом while)*****************************************/
/* 

Console.WriteLine("Введите число N ");
 int.TryParse(Console.ReadLine(), out int number);
 var negativeN = number * (-1);

 while (negativeN <= number)
 {
  Console.Write(negativeN + " ");
  negativeN++;
 }

*/
/*************************************Решение: Вариант 2. (с циклом for)****************************************/
/*

Console.WriteLine("Введите число N ");
int.TryParse(Console.ReadLine(), out int number);

 for (int i = -number; i <= number; i++)
 {
    Console.Write(i + " ");
 }

*/  
/*________________________________________________________________________________________________
++++++++++++++++++++++++++++++++++++++++++++++Задача №7++++++++++++++++++++++++++++++++++++++++ 
________________________________________________________________________________________________*/
/*

Напиши программу, которая  принимает на вход трехзначное число, а на выходе показывает последнюю цыфру этого числа.
Пример:
456 -> 6
782 -> 2
918 -> 8

*/
/************************************Решение: Вариант 1. (с делением с остатком (%))*****************************************/


Console.WriteLine("Введите  трехзначное число ");
int.TryParse(Console.ReadLine(), out int  i);
Console.WriteLine(i % 10);

